# Lesson 04 Task: SQL Basics (Track A)

## Database Applications Development

---

## Instructions

Complete all exercises below. Write SQL queries to answer each question.

**Resources:**
- Keep `SQL_Reference_Guide.md` open
- Review `dbApps04_Walkthrough.ipynb` for examples
- Ask for help if stuck!

**Submission:**
- Complete all TODO sections
- Test that all your queries run without errors
- Push to GitHub: `databaseApplications/dbApps04_Task_TrackA.ipynb`

Let's practice SQL! ðŸš€

---

## Setup

In [11]:
import pandas as pd
import sqlite3

# Connect to database
conn = sqlite3.connect('titanic.db')
print("âœ… Connected to database")

âœ… Connected to database

---

## Part 1: SELECT Basics (5 queries)

Practice selecting specific columns.

### Query 1: Select All Columns

**Task:** Write a query to select ALL columns from the passengers table. Limit to 5 rows.

In [9]:
# TODO: Write your query here
query_1 = """
SELECT *
FROM passengers
"""

result_1 = pd.read_sql(query_1, conn)
display(result_1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,None,C,None,328.0,None
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,None,C,None,NaN,None
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,None,C,None,304.0,None
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,None,C,None,NaN,None
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,None,S,None,NaN,None

### Query 2: Select Name and Age

**Task:** Select only the Name and Age columns. Show first 10 rows.

In [12]:
# TODO: Write your query
query_2 = """
SELECT Name, Age
FROM passengers 
limit 10
"""

result_2 = pd.read_sql(query_2, conn)
display(result_2)

                                              name    age
0                    Allen, Miss. Elisabeth Walton  29.00
1                   Allison, Master. Hudson Trevor   0.92
2                     Allison, Miss. Helen Loraine   2.00
3             Allison, Mr. Hudson Joshua Creighton  30.00
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00
5                              Anderson, Mr. Harry  48.00
6                Andrews, Miss. Kornelia Theodosia  63.00
7                           Andrews, Mr. Thomas Jr  39.00
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00
9                          Artagaveytia, Mr. Ramon  71.00

### Query 3: Select Multiple Columns

**Task:** Select Name, Age, Sex, and Survived columns. Show first 10 rows.

In [14]:
# TODO: Write your query
query_3 = """
SELECT Name, Age, Sex, Survived
FROM Passengers
LIMIT 10
"""

result_3 = pd.read_sql(query_3, conn)
display(result_3)

                                              name    age     sex  survived
0                    Allen, Miss. Elisabeth Walton  29.00  female         1
1                   Allison, Master. Hudson Trevor   0.92    male         1
2                     Allison, Miss. Helen Loraine   2.00  female         0
3             Allison, Mr. Hudson Joshua Creighton  30.00    male         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  female         0
5                              Anderson, Mr. Harry  48.00    male         1
6                Andrews, Miss. Kornelia Theodosia  63.00  female         1
7                           Andrews, Mr. Thomas Jr  39.00    male         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female         1
9                          Artagaveytia, Mr. Ramon  71.00    male         0

### Query 4: Select Name, Pclass, and Fare

**Task:** Select Name, Pclass, and Fare columns. Show first 10 rows.

In [15]:
# TODO: Write your query
query_4 = """
SELECT Name, Pclass, Fare
FROM Passengers
LIMIT 10
"""

result_4 = pd.read_sql(query_4, conn)
display(result_4)

                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
1                   Allison, Master. Hudson Trevor       1  151.5500
2                     Allison, Miss. Helen Loraine       1  151.5500
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                              Anderson, Mr. Harry       1   26.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583
7                           Andrews, Mr. Thomas Jr       1    0.0000
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792
9                          Artagaveytia, Mr. Ramon       1   49.5042

### Query 5: Your Choice!

**Task:** Select ANY 3 columns you want. Show 10 rows. Explain your choice below.

In [17]:
# TODO: Write your query
query_5 = """
SELECT Name, Pclass, sibsp, cabin
FROM Passengers
LIMIT 10
"""

result_5 = pd.read_sql(query_5, conn)
display(result_5)

                                              name  pclass  sibsp    cabin
0                    Allen, Miss. Elisabeth Walton       1      0       B5
1                   Allison, Master. Hudson Trevor       1      1  C22 C26
2                     Allison, Miss. Helen Loraine       1      1  C22 C26
3             Allison, Mr. Hudson Joshua Creighton       1      1  C22 C26
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1      1  C22 C26
5                              Anderson, Mr. Harry       1      0      E12
6                Andrews, Miss. Kornelia Theodosia       1      1       D7
7                           Andrews, Mr. Thomas Jr       1      0      A36
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1      2     C101
9                          Artagaveytia, Mr. Ramon       1      0     None

**Why I chose these columns:** I wanted to see of which class had the most families together. I thought that selecting sibsp would show if they traveled with anyone, then selected the cabin to compare if anyone had matching cabin numbers.

---

## Part 2: WHERE Clause - Filtering (6 queries)

Practice filtering rows with conditions.

### Query 6: Passengers Over Age 30

**Task:** Find all passengers older than 30. Show Name and Age.

In [21]:
# TODO: Write your query
query_6 = """
SELECT Name, age
FROM Passengers
Where age >= 30
"""

result_6 = pd.read_sql(query_6, conn)
print(f"Found {len(result_6)} passengers over 30")
display(result_6.head(10))

Found 477 passengers over 30

                                              name   age
0             Allison, Mr. Hudson Joshua Creighton  30.0
1                              Anderson, Mr. Harry  48.0
2                Andrews, Miss. Kornelia Theodosia  63.0
3                           Andrews, Mr. Thomas Jr  39.0
4    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0
5                          Artagaveytia, Mr. Ramon  71.0
6                           Astor, Col. John Jacob  47.0
7             Barkworth, Mr. Algernon Henry Wilson  80.0
8  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0
9                            Bazzani, Miss. Albina  32.0

### Query 7: Female Passengers

**Task:** Find all female passengers. Show Name, Age, and Sex. Limit to 10 rows.

In [23]:
# TODO: Write your query (remember: text needs single quotes!)
query_7 = """
SELECT Name, Age, Sex
FROM Passengers
WHERE sex = 'female'
LIMIT 10

"""

result_7 = pd.read_sql(query_7, conn)
display(result_7)

                                                name   age     sex
0                      Allen, Miss. Elisabeth Walton  29.0  female
1                       Allison, Miss. Helen Loraine   2.0  female
2    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.0  female
3                  Andrews, Miss. Kornelia Theodosia  63.0  female
4      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0  female
5  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0  female
6                      Aubart, Mme. Leontine Pauline  24.0  female
7                       Barber, Miss. Ellen "Nellie"  26.0  female
8    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0  female
9                              Bazzani, Miss. Albina  32.0  female

### Query 8: First Class Passengers

**Task:** Find all first class passengers (Pclass = 1). Show Name, Pclass, and Fare. Limit to 10.

In [25]:
# TODO: Write your query
query_8 = """
SELECT Name, Pclass, Fare
FROM Passengers
WHERE Pclass = 1
LIMIT 10

"""

result_8 = pd.read_sql(query_8, conn)
display(result_8)

                                              name  pclass      fare
0                    Allen, Miss. Elisabeth Walton       1  211.3375
1                   Allison, Master. Hudson Trevor       1  151.5500
2                     Allison, Miss. Helen Loraine       1  151.5500
3             Allison, Mr. Hudson Joshua Creighton       1  151.5500
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  151.5500
5                              Anderson, Mr. Harry       1   26.5500
6                Andrews, Miss. Kornelia Theodosia       1   77.9583
7                           Andrews, Mr. Thomas Jr       1    0.0000
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)       1   51.4792
9                          Artagaveytia, Mr. Ramon       1   49.5042

### Query 9: Survivors

**Task:** Find all passengers who survived (Survived = 1). Show Name, Age, Sex, and Survived. Limit to 15.

In [26]:
# TODO: Write your query
query_9 = """
SELECT Name, Age, Sex
FROM Passengers
WHERE Survived = 1
LIMIT 15

"""

result_9 = pd.read_sql(query_9, conn)
display(result_9)

                                                 name    age     sex
0                       Allen, Miss. Elisabeth Walton  29.00  female
1                      Allison, Master. Hudson Trevor   0.92    male
2                                 Anderson, Mr. Harry  48.00    male
3                   Andrews, Miss. Kornelia Theodosia  63.00  female
4       Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female
5   Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.00  female
6                       Aubart, Mme. Leontine Pauline  24.00  female
7                        Barber, Miss. Ellen "Nellie"  26.00  female
8                Barkworth, Mr. Algernon Henry Wilson  80.00    male
9     Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.00  female
10                              Bazzani, Miss. Albina  32.00  female
11                      Beckwith, Mr. Richard Leonard  37.00    male
12   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.00  female
13                              Behr, Mr. Karl Howell  26.00    male
14                              Bidois, Miss. Rosalie  42.00  female

### Query 10: Passengers Who Paid High Fares

**Task:** Find passengers who paid more than $50. Show Name, Fare, and Pclass. Limit to 10.

In [29]:
# TODO: Write your query
query_10 = """
SELECT Name, Fare, Pclass
FROM Passengers
WHERE Fare >= 50
LIMIT 10
"""

result_10 = pd.read_sql(query_10, conn)
display(result_10)

                                                name      fare  pclass
0                      Allen, Miss. Elisabeth Walton  211.3375       1
1                     Allison, Master. Hudson Trevor  151.5500       1
2                       Allison, Miss. Helen Loraine  151.5500       1
3               Allison, Mr. Hudson Joshua Creighton  151.5500       1
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  151.5500       1
5                  Andrews, Miss. Kornelia Theodosia   77.9583       1
6      Appleton, Mrs. Edward Dale (Charlotte Lamson)   51.4792       1
7                             Astor, Col. John Jacob  227.5250       1
8  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  227.5250       1
9                      Aubart, Mme. Leontine Pauline   69.3000       1

### Query 11: Children (Age 12 or Under)

**Task:** Find children age 12 or under. Show Name and Age. Limit to 10.

In [30]:
# TODO: Write your query
query_11 = """
SELECT Name, Age
FROM Passengers
WHERE Age <= 12
LIMIT 10
"""

result_11 = pd.read_sql(query_11, conn)
display(result_11)

                                  name    age
0       Allison, Master. Hudson Trevor   0.92
1         Allison, Miss. Helen Loraine   2.00
2  Carter, Master. William Thornton II  11.00
3            Dodge, Master. Washington   4.00
4      Spedden, Master. Robert Douglas   6.00
5            Becker, Master. Richard F   1.00
6          Becker, Miss. Marion Louise   4.00
7         Becker, Miss. Ruth Elizabeth  12.00
8        Caldwell, Master. Alden Gates   0.83
9     Collyer, Miss. Marjorie "Lottie"   8.00

---

## Part 3: Multiple Conditions with AND (3 queries)

### Query 12: Female Survivors

**Task:** Find female passengers who survived. Show Name, Age, Sex, and Survived. Limit to 10.

In [ ]:
# TODO: Write your query (use AND)
query_12 = """
SELECT Name, Age, Sex, Survived
FROM Passengers

"""

result_12 = pd.read_sql(query_12, conn)
display(result_12)

### Query 13: Young Adults (Ages 18-30)

**Task:** Find passengers between age 18 and 30 (inclusive). Show Name and Age. Limit to 15.

**Hint:** You need TWO conditions with AND: `Age >= 18 AND Age <= 30`

In [ ]:
# TODO: Write your query
query_13 = """

"""

result_13 = pd.read_sql(query_13, conn)
display(result_13)

### Query 14: Male First Class Survivors

**Task:** Find male passengers in first class who survived. Show Name, Age, Sex, Pclass, Survived. Limit to 10.

**Hint:** THREE conditions with AND!

In [ ]:
# TODO: Write your query
query_14 = """

"""

result_14 = pd.read_sql(query_14, conn)
display(result_14)

---

## Part 4: ORDER BY - Sorting (4 queries)

### Query 15: Sort by Age (Youngest First)

**Task:** Show Name and Age, sorted by age from youngest to oldest. Limit to 10.

In [ ]:
# TODO: Write your query
query_15 = """

"""

result_15 = pd.read_sql(query_15, conn)
display(result_15)

### Query 16: Sort by Age (Oldest First)

**Task:** Show Name and Age, sorted by age from oldest to youngest. Limit to 10.

**Hint:** Use DESC!

In [ ]:
# TODO: Write your query
query_16 = """

"""

result_16 = pd.read_sql(query_16, conn)
display(result_16)

### Query 17: Sort by Fare (Highest First)

**Task:** Show Name, Fare, and Pclass, sorted by fare from highest to lowest. Limit to 10.

In [ ]:
# TODO: Write your query
query_17 = """

"""

result_17 = pd.read_sql(query_17, conn)
display(result_17)

### Query 18: Sort by Name (Alphabetical)

**Task:** Show Name, Age, and Sex, sorted alphabetically by name. Limit to 15.

In [ ]:
# TODO: Write your query
query_18 = """

"""

result_18 = pd.read_sql(query_18, conn)
display(result_18)

---

## Part 5: Combined Queries (3 challenges)

Put it all together: SELECT, WHERE, ORDER BY, LIMIT

### Query 19: Young Female Survivors

**Task:** Find female passengers under age 20 who survived. Show Name, Age, Sex, Survived. Sort by age (youngest first). Limit to 10.

In [ ]:
# TODO: Write your query
query_19 = """

"""

result_19 = pd.read_sql(query_19, conn)
display(result_19)

### Query 20: Wealthy First Class Passengers

**Task:** Find first class passengers who paid more than $100. Show Name, Pclass, Fare. Sort by fare (highest first). Limit to 10.

In [ ]:
# TODO: Write your query
query_20 = """

"""

result_20 = pd.read_sql(query_20, conn)
display(result_20)

### Query 21: Create Your Own Challenge!

**Task:** Write your own query using:
- SELECT (specific columns)
- WHERE (at least 2 conditions with AND)
- ORDER BY
- LIMIT

Describe what you're looking for:

**My query finds:** (describe here)

In [ ]:
# TODO: Write your creative query!
query_21 = """

"""

result_21 = pd.read_sql(query_21, conn)
display(result_21)

---

## Reflection Questions

Answer these questions in the markdown cells below:

### Question 1: SQL vs. pandas

**How is writing WHERE in SQL similar to filtering in pandas? How is it different?**

*Your answer here:*

### Question 2: ORDER BY

**When would you use ORDER BY ASC vs. ORDER BY DESC? Give a real-world example for each.**

*Your answer here:*

### Question 3: Most Challenging

**Which query was hardest for you? Why? How did you figure it out?**

*Your answer here:*

---

## Clean Up

In [ ]:
# Close database connection
conn.close()
print("âœ… Connection closed. Great work!")

---

## âœ… Before You Submit

Make sure you:
- [ ] Completed all 21 queries
- [ ] Answered all reflection questions
- [ ] Tested that all cells run without errors
- [ ] Used proper SQL syntax (SELECT â†’ FROM â†’ WHERE â†’ ORDER BY â†’ LIMIT)
- [ ] Put single quotes around text values
- [ ] Saved your file

**Submit via GitHub:** `databaseApplications/dbApps04_Task_TrackA.ipynb`

**Great work!** You've learned SQL basics! ðŸŽ‰